#+TITLE: Atomistic investigation of dislocation-assisted carbon migration in iron
#+AUTHOR: Tigany Zarrouk
#+BIBLIOGRAPHY: ./bibliography/org-refs.bib
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper,11pt]
#+LATEX_HEADER: \usepackage{rotating}
#+LATEX_HEADER: \usepackage[margin=1.25in]{geometry}
#+LATEX_HEADER: \usepackage{subfigure}
#+LATEX_HEADER: \usepackage{pdflscape}


\clearpage

   \begin{abstract}

  Martensitic bearing steels have been shown to undergo subsurface microstructural decay,
  forming Dark Etching Regions (DERs), promoting failure through rolling contact fatigue
  (RCF). Dislocation-assisted carbon migration is thought to be the underlying mechanism,
  yet empirical studies have been inconclusive as to how dislocations move carbon and
  where excess carbon from the martensitic matrix migrates to upon transformation to
  ferrite---a phase of significantly lower carbon solubility. In this report, we detail
  the first stages of a multi-scale modelling approach to elucidate carbon transport by
  dislocations. Tight-binding simulations of carbon interactions with the $1/2\langle 111
  \rangle$ screw dislocation found solute distribution to vary significantly within
  $\sim2$b of the easy and hard cores; the highest binding energy being found in the
  centre of the hard screw core---which is the ground state carbon-dislocation
  configuration---in agreement with Density Functional Theory (DFT). Determination of
  equilibrium carbon concentration along dislocation lines, at various dislocation
  densities and nominal carbon concentrations, found most sites around the hard core were
  saturated, with all easy cores reconstructing to hard due to saturation of adjacent
  octahedral sites. In the typical temperature range of bearing operation, we expect all
  dislocations to be of hard core type, pinned by carbon in a prismatic site within the
  dislocation core. We anticipate large drag forces acting on dislocations in the initial
*** F-D Notes                                                      :noexport:
    Fermi-Dirac statistics, or some other
    formulation based on the same assumptions as Fermi-Dirac

    A Fermi-Dirac distribution function is necessary to treat occupation in the lower
    limit:

    \[ \chi_{\text{el}} = \left (
                        \exp \left[ \frac{ E_{\text{form.}} }{ k_{\text{B}} T } \right ] + 1
			\right )^{-1} \]

    In the paper by Nematollahi	cite:Nematollahi2016, we see that the chemical potential
    used is with reference to cementite, $\mu^{\text{Cem.}}_{\text{C}} = \frac{1}{4}
    E_{\text{Cem.}} - 3 E_{\alpha\text{Fe}}$


    In the Luthi paper cite:Luthi2019 they actually give a form for
    the chemical potential:

    \[ \mu = E_0 + k_{\text{B}}T\ln \left( \frac{c_{\text{bulk}}}{1 -
    c_{\text{bulk}}} \right) \]

    \[ \mu = E_0 + k_{\text{B}}T\ln \left( \frac{c_{\text{d}}}{1 -
    c_{\text{d}}} \exp \left( E_{\text{seg}} / k_{\text{B} }T \right) \right) \]


    $E_0$ is the energy of incorporating one isolated carbon atom into
    a bulk octahedral site cite:Fowler


    There are multiple analyses here. I will elucidate them.

    From cite:Nematollahi2016, we have the Fermi-Dirac distribution
    which controls the occupancies. C-C interactions are important for
    the concentration. From cite:Veiga2011, they use atomistic
    calculations to work out the occupancy. According to the paper by
    cite:Nematollahi2016, they say that in this paper, the occupancies
    reach a maximum of 0.04. This means that they cut off their
    fermi-dirac distribution function at that value.

    The assumptions on which Fermi-Dirac statistics is based, namely
    an answer to the question of how to distribute indistinguishable
    with negligible interaction with each other, is taken into account
    by the Mclean isotherm cite:Veiga2013. As detailed in the original
    formulation of Louat cite:Louat1956, it is assumed that the area
    around the dislocation is divided into a number of sub-regions
    where only one solute atom can occupy each position, and there are
    no inter-line or inter-site interactions. In this
    formulation, one only accounts for the configurational entropy of
    the system of different sites on the effective
    lattice. Electronic, vibrational and magnetic entropic
    contributions are not taken into account cite:Ventelon2015.

    The assumption of this effective lattice (sub-region delineation)
    to account for the concentration of solutes around a defect, may
    not take into account all of the configurational entropy as noted
    in cases of hydrogen/hydrogen-vacancy complexes in Fe
    cite:Davidson2020. This becomes apparent when there are low
    binding energies involved, such as that of hydrogen to
    interstitial and vacancy sites. Hydrogen is able to move in a
    smooth and continuous potential, resulting in a larger
    configurational phase space available to hydrogen than just the
    sampled binding sites taken into account.
    We expect due to the large binding energy of carbon to
    dislocations for a range of distances, the configurational entropy
    in reality will not be significantly enhanced compared to the
    lattice model.



    A discrete diffusion model (DDM) can be used to model the carbon
    occupancies as a function of time.
     - In Nematollahi, the change in occupancies is dependent on the
       activation of the energy barrier between sites.
     - This energy barrier is the migration energy barrier

       \begin{align*}
         \frac{\partial \chi_i}{\partial t} = \sum_{j=1}^4 \left\{
       &\chi_j (1 - \chi_i) \nu_0^{\text{migration}} \exp{\left[ -
       E_{\text{barrier}}^{i\rightarrow j} / k_{\text{B}} T\right]}\\ -
              &\chi_i (1 - \chi_j) \nu_0^{\text{migration}} \exp{\left[ -
      E_{\text{barrier}}^{j\rightarrow i} / k_{\text{B}} T\right]}
       \right\} + \frac{\bar{v}_{\text{disl}}}{a/2} [x_{j+} - x_{i}]
       \end{align*}


     - Last term is a convection term which can be added to account for
       a moving dislocation (going to the right)
     - Where a $j+$ site is to the right of the $i^{\text{th}}$ site,
       and an $j-$ occupied to the left.
     - With dislocation movement the occupations /move backwards/ from
       the $j+$ to $i^{\text{th}}$ and from $i^{\text{th}}$ to $j-$
       sites.
     - Summation over 4 as 4 "first-neighbour" octahedral sites.


     - In Ivo's paper, the change in occupancy has a time dependence,
       which is due to the velocity of a dislocation.
     - This mediated between the two limiting regimes of static and
       equilbrium occupancies upon dislocation motion.

       \[ \frac{\partial \chi_i}{\partial t} = \bar{v}\frac{\partial
       \chi_i}{\partial x} = \left( \chi_i^e(x) - \chi_i(x,\bar{v})
       \right) \nu_0^{\text{solute escape}} \exp{ - E_i(r) / k_{\text{B}} T} \]

     - Here the attempt frequencies are different as one is for a
       hydrogen to escape from the binding of the dislocation to the
       bulk, and the other is to escape the relative energy barrier
       between sites.
     - If it is possible to assume that one can superimpose the
       occupancy effects of carbon _diffusion_, then we can have an
       equation for the velocity dependence.

     - Ivo uses the prefactor in his equation as the one for carbon
       diffusion $\nu_0 = 1.2 \times 10^{13}$ , slightly higher than
       the one I calculated.
     - He really should be using something different as the quantity
       really is something else, I believe.

     - How valid is this assumption? The attempt frequency is that of
       diffusion. We obtain the prefactor usually from from
       [[file:../../roam/2021-03-04--14-44-41--transition_state_theory.org][transition-state theory]], from the ratio of phonon frequencies
       at the transition state to the initial state.

     - We currently do not have access to this transition state
       without neb calculations.


     - How can we actually go about this in practise?

       1) Do NEB calculation of the migration barrier between carbon of
          different sites around the dislocation. These are apparently
          between sublattices, as found in Nematollahi.
       2) Which sites contribute? Supposedly around the core of the
          dislocation, where the high mobility zone is.
       3) As such we can measure this for the hard core, which has not
          been done before.
       4) Phonon calculation at the transition state and initial
          state and final state for the forward and backward rates.

     

    # E
    # H = U + pV = Energy
    # F = U - TS = Energy available for mechanical work (the rest of the
    # energy left over after entropic effects accounted for)
    # G = U - TS = pV



    _Method_
    - Make the fermi-dirac distribution top out at 0.6, and make it
      vary with distance from there. Perhaps have a linear function
      multiply the region between the highest and lowest.
    - We keep the simulations at 300K, and looking at the data from
      Lüthi, we can keep the same caps, as there is no significant
      change from 100-1000 appm.
    - This does bring into question what we are even doing with the
      concentrations though. If the actual concentration of the
      prismatic and O4 sites does not change in these ranges, then it
      must be that the changes in the carbon concentration further
      from the core has a marked effect on the actual dislocation
      motion, when comparing between the different regimes.



    # showing account for the C-C
    # interactions by having the probability from a Maxwell-Boltzmann
    # statistical view,


    #+begin_src julia :results output
      # Defining the fermi dirac function
      # ΔHf cementite = -0.115 from Tony's paper
      E_θ_cem = -9.638578390000 # Ryd, from 16 atom unit cell
      E_α_fe  = -0.499694880000 # Ryd, from 1  atom unit cell
      E_fe3c = E_cem / 4

      μᶜ_cem = E_fe3c - 3*E_α_fe # -0.9105451150000001 Ryd = -12.38880724 eV

      E_perf   = -255.22913581
      E_perf_C = -256.063848525
      μα_c = E_perf_C - E_perf # -0.8347127150000233 Ryd

      Δμ = μᶜ_cem - μα_c # -0.07583239999997682 Ryd
      Δμ = - μᶜ_cem + μα_c # 0.07583239999997682 Ryd

      Δμ * 13.606 # -1.0317756343996847 eV

      # Binding energy defined in the opposite sense to Nematollahi
      # # Ebind = -esol = Edc + Ep - Ec -Ed
      #  mu_c = Ec - Ep
      # Ebind = Eds - Ed - mu_c
      # Ebind = (Eds - Ed - mu_c) + mu_c - mu_cem
      # Ebind = (-Ei) + mu_c - mu_cem

    #+end_src

    #+RESULTS:
    : -9.63857839
    : -0.49969488
    : -255.22913581
    : -256.063848525
    : -0.8347127150000233


